tests/fixtures/xml/new_sale.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Header/>
  <SOAP-ENV:Body>
    <ipgapi:IPGApiOrderRequest xmlns:v1="http://ipg-online.com/ipgapi/schemas/v1" xmlns:ipgapi="http://ipg-online.com/ipgapi/schemas/ipgapi">
      <v1:Transaction>
        <v1:CreditCardTxType>
          <v1:Type>credit</v1:Type>
        </v1:CreditCardTxType>
        <v1:CreditCardData>
          <v1:CardNumber>411111111111</v1:CardNumber>
          <v1:ExpMonth>12</v1:ExpMonth>
          <v1:ExpYear>30</v1:ExpYear>
          <v1:CardCodeValue>123</v1:CardCodeValue>
        </v1:CreditCardData>
      </v1:Transaction>
    </ipgapi:IPGApiOrderRequest>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
