vendas/requisicao-pedido-1619206453223.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
    <SOAP-ENV:Header />
    <SOAP-ENV:Body>
        <ipgapi:IPGApiOrderRequest xmlns:v1="http://ipg-online.com/ipgapi/schemas/v1" xmlns:ipgapi="http://ipg-online.com/ipgapi/schemas/ipgapi">
            <v1:Transaction>
                <v1:CreditCardTxType>
                    <v1:Type>sale</v1:Type>
                </v1:CreditCardTxType>
                <v1:CreditCardData>
                    <v1:CardNumber>5105561794118996</v1:CardNumber>
                    <v1:ExpMonth>04</v1:ExpMonth>
                    <v1:ExpYear>26</v1:ExpYear>                    <v1:CardCodeValue>123</v1:CardCodeValue>
                </v1:CreditCardData>
                <v1:cardFunction>credit</v1:cardFunction>
                <v1:Payment>
                                         <v1:ChargeTotal>30.05</v1:ChargeTotal>
                    <v1:Currency>986</v1:Currency>
                </v1:Payment>                <v1:TransactionDetails>
                     <v1:OrderId>pedido-1619206453223</v1:OrderId>
                </v1:TransactionDetails>
            </v1:Transaction>
        </ipgapi:IPGApiOrderRequest>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>